## Plan Result (Prod - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 56 to add, 4 to change, 56 to destroy.</code></pre>

* Update
  * module.apply-divorce.azurerm_dns_txt_record.this[&#34;_dnsauth.www&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_E0BDCD3E999D84AEC133A95F71EE1F18.wfmapp.preprod&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_E0BDCD3E999D84AEC133A95F71EE1F18.wfmapp.training&#34;]
  * module.prod-platform.azurerm_dns_cname_record.this[&#34;_AC285A78514B19D657B18C29B98F4C7F.vh-admin-web&#34;]
* Replace
  * module.appeal-benefit.azurerm_role_assignment.dnszonecontributer
  * module.appeal-immigration.azurerm_role_assignment.dnszonecontributer
  * module.appeal-tax-tribunal.azurerm_role_assignment.dnszonecontributer
  * module.apply-divorce.azurerm_role_assignment.dnszonecontributer
  * module.apply-for-probate.azurerm_role_assignment.dnszonecontributer
  * module.apply-to-adopt-a-child-placed-in-your-care.azurerm_role_assignment.dnszonecontributer
  * module.apply-to-court-about-child-arrangements-c100.azurerm_role_assignment.dnszonecontributer
  * module.apps-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.apps-nle-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.c100-application.azurerm_role_assignment.dnszonecontributer
  * module.casetracker.azurerm_role_assignment.dnszonecontributer
  * module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer
  * module.cjscp_org_uk.azurerm_role_assignment.dnszonecontributer
  * module.claim-employment-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.courtfines.azurerm_role_assignment.dnszonecontributer
  * module.courttribunalfinder.azurerm_role_assignment.dnszonecontributer
  * module.ctsc-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.darts-nle-service.azurerm_role_assignment.dnszonecontributer
  * module.darts-service.azurerm_role_assignment.dnszonecontributer
  * module.ejudiciary_net.azurerm_role_assignment.dnszonecontributer
  * module.employment-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.end-civil-partnership.azurerm_role_assignment.dnszonecontributer
  * module.erupload-justice.azurerm_role_assignment.dnszonecontributer
  * module.eruploadtest-justice.azurerm_role_assignment.dnszonecontributer
  * module.find-court-tribunal.azurerm_role_assignment.dnszonecontributer
  * module.hearings.azurerm_role_assignment.dnszonecontributer
  * module.hearings_reform_hmcts_net.azurerm_role_assignment.dnszonecontributer
  * module.helpwithcourtfees.azurerm_role_assignment.dnszonecontributer
  * module.hmcts-access.azurerm_role_assignment.dnszonecontributer
  * module.hmcts-webchat.azurerm_role_assignment.dnszonecontributer
  * module.hmcts_net.azurerm_role_assignment.dnszonecontributer
  * module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer
  * module.internal-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.jcm-judiciary.azurerm_role_assignment.dnszonecontributer
  * module.juror-bureau.azurerm_role_assignment.dnszonecontributer
  * module.mailrelay-platform-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.manage-your-support-for-hmcts-services.azurerm_role_assignment.dnszonecontributer
  * module.mft-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.moneyclaims.azurerm_role_assignment.dnszonecontributer
  * module.pip-court-tribunal-hearings.azurerm_role_assignment.dnszonecontributer
  * module.platform-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.pre-recorded-evidence-justice.azurerm_role_assignment.dnszonecontributer
  * module.probatesearch.azurerm_role_assignment.dnszonecontributer
  * module.prod-hmcts-net.azurerm_role_assignment.dnszonecontributer
  * module.prod-internal.azurerm_role_assignment.dnszonecontributer
  * module.prod-platform.azurerm_role_assignment.dnszonecontributer
  * module.reform-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.reply-jury-summons.azurerm_role_assignment.dnszonecontributer
  * module.residential-property-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.respond-divorce.azurerm_role_assignment.dnszonecontributer
  * module.respond-employment-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.sftp-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.special-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.track-benefit-appeal.azurerm_role_assignment.dnszonecontributer
  * module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer
  * module.vh.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appeal-benefit.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/appeal-benefit-decision.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/9cec249b-557c-6288-f7d6-b70738ee8a96" -> (known after apply)
      ~ name                                   = "9cec249b-557c-6288-f7d6-b70738ee8a96" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.appeal-immigration.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/appeal-immigration-asylum-decision.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/2cec231a-eaae-4eba-06cb-550cb404f1a5" -> (known after apply)
      ~ name                                   = "2cec231a-eaae-4eba-06cb-550cb404f1a5" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.appeal-tax-tribunal.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/appeal-tax-tribunal.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/a4c788a8-7802-024a-6aee-14bb1c8fc74d" -> (known after apply)
      ~ name                                   = "a4c788a8-7802-024a-6aee-14bb1c8fc74d" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.apply-divorce.azurerm_dns_txt_record.this["_dnsauth.www"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc"
        }
    }

  # module.apply-divorce.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/a051dbd2-a188-5365-b161-4a2c76c74757" -> (known after apply)
      ~ name                                   = "a051dbd2-a188-5365-b161-4a2c76c74757" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.apply-for-probate.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-for-probate.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/a9a10efe-fedb-8aaa-60da-311cd89c9f74" -> (known after apply)
      ~ name                                   = "a9a10efe-fedb-8aaa-60da-311cd89c9f74" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.apply-to-adopt-a-child-placed-in-your-care.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-to-adopt-a-child-placed-in-your-care.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/abc3392f-ea20-dfa2-ffb0-9690e64de890" -> (known after apply)
      ~ name                                   = "abc3392f-ea20-dfa2-ffb0-9690e64de890" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.apply-to-court-about-child-arrangements-c100.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-to-court-about-child-arrangements-c100.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/51025d33-388e-4be3-5331-a536b67a8b7f" -> (known after apply)
      ~ name                                   = "51025d33-388e-4be3-5331-a536b67a8b7f" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.apps-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apps.hmcts.net/providers/Microsoft.Authorization/roleAssignments/3c44a0e5-ccc3-0143-aadf-710d6fc650a2" -> (known after apply)
      ~ name                                   = "3c44a0e5-ccc3-0143-aadf-710d6fc650a2" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.apps-nle-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apps-nle.hmcts.net/providers/Microsoft.Authorization/roleAssignments/97404cb3-085f-5a40-7e89-d7bcb02b35fe" -> (known after apply)
      ~ name                                   = "97404cb3-085f-5a40-7e89-d7bcb02b35fe" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.c100-application.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-to-court-about-child-arrangements.service.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/f61c1a63-90fb-90cf-3d3c-67a06fd7ce0e" -> (known after apply)
      ~ name                                   = "f61c1a63-90fb-90cf-3d3c-67a06fd7ce0e" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.casetracker.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/casetracker.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/9f10465f-1e7f-4d17-6b85-25d34819ad18" -> (known after apply)
      ~ name                                   = "9f10465f-1e7f-4d17-6b85-25d34819ad18" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/certificatedbailiffs.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/52612a8a-b7a5-1c6e-34ea-8bb800c3b59b" -> (known after apply)
      ~ name                                   = "52612a8a-b7a5-1c6e-34ea-8bb800c3b59b" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.cjscp_org_uk.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/cjscp.org.uk/providers/Microsoft.Authorization/roleAssignments/0ac18e08-33c9-3a70-7f75-59bd34243ee9" -> (known after apply)
      ~ name                                   = "0ac18e08-33c9-3a70-7f75-59bd34243ee9" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.claim-employment-tribunals.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/claim-employment-tribunals.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/e643257b-d3ef-42c5-c1fd-7ace9783e0c4" -> (known after apply)
      ~ name                                   = "e643257b-d3ef-42c5-c1fd-7ace9783e0c4" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.courtfines.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/courtfines.direct.gov.uk/providers/Microsoft.Authorization/roleAssignments/966a7bc2-a6fe-bc85-5bb0-6059d23f3d7d" -> (known after apply)
      ~ name                                   = "966a7bc2-a6fe-bc85-5bb0-6059d23f3d7d" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.courttribunalfinder.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/courttribunalfinder.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/60a8bdfa-97a4-0784-788c-cb48c3272cfc" -> (known after apply)
      ~ name                                   = "60a8bdfa-97a4-0784-788c-cb48c3272cfc" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ctsc-hmcts.azurerm_dns_cname_record.this["_E0BDCD3E999D84AEC133A95F71EE1F18.wfmapp.preprod"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/ctsc.hmcts.net/CNAME/_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod"
        name                = "_e0bdcd3e999d84aec133a95f71ee1f18.wfmapp.preprod"
      ~ record              = "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.586ee5cb5f17541372cd.sectigo.com." -> "603D81996C47863EDFE41A6ED2EF3224.A1363BE712CA02F75C3C5259EC7D4680.9b1211e0578d0fbcf7ab.sectigo.com."
        tags                = {}
        # (5 unchanged attributes hidden)
    }

  # module.ctsc-hmcts.azurerm_dns_cname_record.this["_E0BDCD3E999D84AEC133A95F71EE1F18.wfmapp.training"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscr

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/court-tribunal-hearings.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/0506e7e5-323e-1bd4-99b2-c07773996678" -> (known after apply)
      ~ name                                   = "0506e7e5-323e-1bd4-99b2-c07773996678" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.platform-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/5dbaff78-6c93-cc2f-3460-b7def8562dea" -> (known after apply)
      ~ name                                   = "5dbaff78-6c93-cc2f-3460-b7def8562dea" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.pre-recorded-evidence-justice.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/pre-recorded-evidence.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/ef0ee292-cc75-9504-ecd6-67350a9b38cb" -> (known after apply)
      ~ name                                   = "ef0ee292-cc75-9504-ecd6-67350a9b38cb" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.probatesearch.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/probatesearch.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/2b4dcf45-0e13-5ec0-1679-bfc752c537d8" -> (known after apply)
      ~ name                                   = "2b4dcf45-0e13-5ec0-1679-bfc752c537d8" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.prod-hmcts-net.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/prod.hmcts.net/providers/Microsoft.Authorization/roleAssignments/634e16f0-a2ca-1adb-a127-41a88b7e8f97" -> (known after apply)
      ~ name                                   = "634e16f0-a2ca-1adb-a127-41a88b7e8f97" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.prod-internal.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/prod.internal.hmcts.net/providers/Microsoft.Authorization/roleAssignments/eb1dbcc1-adf3-bf59-176e-c54e2a85f85e" -> (known after apply)
      ~ name                                   = "eb1dbcc1-adf3-bf59-176e-c54e2a85f85e" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.prod-platform.azurerm_dns_cname_record.this["_AC285A78514B19D657B18C29B98F4C7F.vh-admin-web"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/prod.platform.hmcts.net/CNAME/_ac285a78514b19d657b18c29b98f4c7f.vh-admin-web"
        name                = "_ac285a78514b19d657b18c29b98f4c7f.vh-admin-web"
      ~ record              = "032DDB9A61BB0588601DD6D4C005A812.302202E1FB30DE99CD976C202BDB71AC.fbb25c1fc3c9ad12a80d.sectigo.com." -> "032DDB9A61BB0588601DD6D4C005A812.302202E1FB30DE99CD976C202BDB71AC.d7703fe5d42a59a77748.sectigo.com."
        tags                = {}
        # (5 unchanged attributes hidden)
    }

  # module.prod-platform.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/prod.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/b1996b9a-0100-f1d9-08d6-c46d6b8787b1" -> (known after apply)
      ~ name                                   = "b1996b9a-0100-f1d9-08d6-c46d6b8787b1" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.reform-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/reform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/8783a3d5-5a03-ff3a-a850-d935a7f0ff68" -> (known after apply)
      ~ name                                   = "8783a3d5-5a03-ff3a-a850-d935a7f0ff68" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.reply-jury-summons.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/reply-jury-summons.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/4d5969f7-3a8a-43f9-7129-792b92d2b96d" -> (known after apply)
      ~ name                                   = "4d5969f7-3a8a-43f9-7129-792b92d2b96d" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.residential-property-tribunals.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/residential-property-tribunals.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/1fccdcbb-d8d3-f8f4-10c0-c3d38c2c8614" -> (known after apply)
      ~ name                                   = "1fccdcbb-d8d3-f8f4-10c0-c3d38c2c8614" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.respond-divorce.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/respond-divorce.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/80d8c5be-6a12-d6f0-bbee-39066ba0ac4f" -> (known after apply)
      ~ name                                   = "80d8c5be-6a12-d6f0-bbee-39066ba0ac4f" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.respond-employment-tribunals.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/respond-employment-tribunals.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/42687a96-4675-7d04-d8bc-427162eb9317" -> (known after apply)
      ~ name                                   = "42687a96-4675-7d04-d8bc-427162eb9317" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sftp-hmcts.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sftp.hmcts.net/providers/Microsoft.Authorization/roleAssignments/702c5c8c-2cba-b7f2-8bdf-e2527b0ca758" -> (known after apply)
      ~ name                                   = "702c5c8c-2cba-b7f2-8bdf-e2527b0ca758" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.special-tribunals.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/special-tribunals.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/c6d810ff-58fd-eb79-4126-8c0f14e46cb7" -> (known after apply)
      ~ name                                   = "c6d810ff-58fd-eb79-4126-8c0f14e46cb7" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.track-benefit-appeal.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/track-benefit-appeal.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/64bc54bb-abd3-0d78-543c-05be3c41603f" -> (known after apply)
      ~ name                                   = "64bc54bb-abd3-0d78-543c-05be3c41603f" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/tribunalsdecisions.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/22d2b96a-fe2e-bacf-26c9-a13ced08a2f4" -> (known after apply)
      ~ name                                   = "22d2b96a-fe2e-bacf-26c9-a13ced08a2f4" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.vh.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/vh.hmcts.net/providers/Microsoft.Authorization/roleAssignments/993e75b5-91cb-d09b-ce6b-f127f4f4ecc1" -> (known after apply)
      ~ name                                   = "993e75b5-91cb-d09b-ce6b-f127f4f4ecc1" -> (known after apply)
      ~ principal_id                           = "2608a08f-b9d5-45a8-b641-207f574a0b60" -> "/groups/2608a08f-b9d5-45a8-b641-207f574a0b60" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 56 to add, 4 to change, 56 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1856,"Program":"tfcmt","SHA1":"","Target":"Prod - TerraformPlanApply","Vars":{}} -->